app/Controllers/Artikel.php

    public function kategori($kategori)
    {
        $model = new ArtikelModel();
        $artikel = $model->where([
            'kategori' => $kategori
        ])->findAll();
---
SELECT *
FROM `artikel`
WHERE `kategori` = 'Olahraga'